aaa = {"А": "4", "Б": "6", "В": "8", "Г": "Г", "Д": "4", "Е": "3", "Ё": "3", "Ж": "Ж", "З": "З", "И": "И",
       "Й": "Й", "К": "К", "Л": "Л", "М": "М", "Н": "Н", "О": "0", "П": "П", "Р": "9", "С": "С", "Т": "7",
       "У": "У", "Ф": "Ф", "Х": "Х", "Ц": "Ц", "Ч": "Ч", "Ш": "Ш", "Щ": "Щ", "Э": "Э", "Ю": "Ю", "Я": "Я",
       "Ь": "Ь", "Ъ": "Ъ", " ": " ", "а": "4", "б": "6", "в": "8", "г": "Г", "д": "4", "е": "3", "ё": "3",
       "ж": "Ж", "з": "З", "и": "И", "й": "Й", "к": "К", "л": "Л", "м": "М", "н": "Н", "о": "0", "п": "П",
       "р": "9", "с": "С", "т": "7", "у": "У", "ф": "Ф", "х": "Х", "ц": "Ц", "ч": "Ч", "ш": "Ш", "щ": "Щ",
       "э": "Э", "ю": "Ю", "я": "Я", "ь": "Ь", "ъ": "Ъ", ",": ",", ".": ".", ":": ":", ";": ";", "-": "-",
       "=": "=", "Ы": "Ы", "ы": "Ы"}

user = input("Enter your code here:")
user_list = list(user)
result = []

for letter in user_list:

    for key in aaa.keys():
        if letter == key:
            dict_letter = aaa[key]

            result.append(dict_letter)

print(''.join(result))



